aidanquandt/hylo/hwconfig/stm32_hwrev_1/Core/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2026 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32h7xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define SPI4_CSn_Pin GPIO_PIN_4
#define SPI4_CSn_GPIO_Port GPIOE
#define UWB_IRQ_Pin GPIO_PIN_0
#define UWB_IRQ_GPIO_Port GPIOF
#define UWB_IRQ_EXTI_IRQn EXTI0_IRQn
#define LED1_Pin GPIO_PIN_4
#define LED1_GPIO_Port GPIOC
#define ESP_nRST_Pin GPIO_PIN_2
#define ESP_nRST_GPIO_Port GPIOB
#define BMI_CS2_Pin GPIO_PIN_10
#define BMI_CS2_GPIO_Port GPIOE
#define BMI_CS1_Pin GPIO_PIN_15
#define BMI_CS1_GPIO_Port GPIOE
#define BMI_CS3_Pin GPIO_PIN_12
#define BMI_CS3_GPIO_Port GPIOD
#define BMI_CS4_Pin GPIO_PIN_13
#define BMI_CS4_GPIO_Port GPIOD
#define SW_button_Pin GPIO_PIN_11
#define SW_button_GPIO_Port GPIOC
#define SDMMC2_CD_Pin GPIO_PIN_13
#define SDMMC2_CD_GPIO_Port GPIOG

/* USER CODE BEGIN Private defines */

/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */
